# Mapping

# import & var

In [23]:
import numpy as np
import pandas as pd

s_exam = pd.Series([10, 125, 1350], index=["idx1", "idx2", "idx3"])

list_val = [[10, 12, 13], [200, 220, 235], [3000, 3250, 3355]]
list_col = ["col1", "col2", "col3"]
df_exam = pd.DataFrame(list_val, columns=list_col)

s = s_exam.copy()
df = df_exam.copy()

# [pandas.Series.map()](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html)
>`Series.map(arg, na_action=None)`<br>
Map values of Series according to an input mapping or function.<br>
Used for substituting each value in a Series with another value, that may be derived from a function, a `dict` or a `Series`.

In [ ]:
s = s_exam.copy()
s

idx1      10
idx2     125
idx3    1350
dtype: int64

In [ ]:
s.map('I am a {}'.format)

idx1      I am a 10
idx2     I am a 125
idx3    I am a 1350
dtype: object

# [pandas.Series.apply()](https://pandas.pydata.org/docs/reference/api/pandas.Series.apply.html)
>```Series.apply(func, convert_dtype=True, args=(), **kwargs)```<br>
Invoke function on values of Series. <br>
Can be ufunc (a NumPy function that applies to the entire Series) or a Python function that only works on single values.

In [24]:
s = s_exam.copy()
s

idx1      10
idx2     125
idx3    1350
dtype: int64

In [25]:
def square(x):
    return x**2


s.apply(square)

idx1        100
idx2      15625
idx3    1822500
dtype: int64

In [26]:
def subtract_custom_value(x, custom_value):
    return x - custom_value

s.apply(subtract_custom_value, args=(50,))

idx1     -40
idx2      75
idx3    1300
dtype: int64

In [27]:
def add_custom_values(x, **kwargs):
    for month in kwargs:
        x += kwargs[month]
    return x


s.apply(add_custom_values, a=1, b=3)

idx1      14
idx2     129
idx3    1354
dtype: int64

# [pandas.DataFrame.apply()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)
>```DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)```<br>
Apply a function along an axis of the DataFrame.<br>
Objects passed to the function are Series objects whose index is either the DataFrame’s index (axis=0) or the DataFrame’s columns (axis=1). ...

In [29]:
df = df_exam.copy()
df

   col1  col2  col3
0    10    12    13
1   200   220   235
2  3000  3250  3355

In [30]:
df.apply(np.sum)

col1    3210
col2    3482
col3    3603
dtype: int64

In [31]:
df.apply(np.sum, axis=1)

0      35
1     655
2    9605
dtype: int64

In [32]:
df.apply(lambda x: x+x.col2, axis=1)

   col1  col2  col3
0    22    24    25
1   420   440   455
2  6250  6500  6605

In [35]:
df.apply(lambda x: x+df["col1"][1], axis=0)

   col1  col2  col3
0   210   212   213
1   400   420   435
2  3200  3450  3555

# [pandas.DataFrame.applymap()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html)

>```DataFrame.applymap(func, na_action=None, **kwargs)``` <br>
Apply a function to a Dataframe elementwise. <br>
This method applies a function that accepts and returns a scalar to every element of a DataFrame.

In [42]:
# exam
df = df_exam.copy()
df

   col1  col2  col3
0    10    12    13
1   200   220   235
2  3000  3250  3355

In [37]:
df.applymap(lambda x: len(str(x)))

   col1  col2  col3
0     2     2     2
1     3     3     3
2     4     4     4

In [40]:
df.applymap(lambda x: x**2)

      col1      col2      col3
0      100       144       169
1    40000     48400     55225
2  9000000  10562500  11256025

In [41]:
df ** 2

      col1      col2      col3
0      100       144       169
1    40000     48400     55225
2  9000000  10562500  11256025

## na_action

In [38]:
df_copy = df.copy()
df_copy.iloc[0, 0] = pd.NA
df_copy

   col1  col2  col3
0  <NA>    12    13
1   200   220   235
2  3000  3250  3355

In [39]:
df_copy.applymap(lambda x: len(str(x)), na_action='ignore')

   col1  col2  col3
0  <NA>     2     2
1     3     3     3
2     4     4     4

# Appendix
## Reference
  - pandas
    - [pandas.Series.apply()](https://pandas.pydata.org/docs/reference/api/pandas.Series.apply.html)
    - [pandas.Series.map()](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html)
    - [pandas.DataFrame.apply()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)
    - [pandas.DataFrame.applymap()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html)
  - wikipedia
    - [사상 (컴퓨팅)](https://ko.wikipedia.org/wiki/%EC%82%AC%EC%83%81_(%EC%BB%B4%ED%93%A8%ED%8C%85))
    - [사상 (수학)](https://ko.wikipedia.org/wiki/%EC%82%AC%EC%83%81_(%EC%88%98%ED%95%99))
  - [나무위키 : 매핑](https://namu.wiki/w/%EB%A7%A4%ED%95%91)
  - [[Pandas 기초] 함수 매핑(mapping)](https://yganalyst.github.io/data_handling/Pd_9/)
  - [[파이썬] 판다스(pandas) 팁40. apply(), map(), applymap() 함수의 적용 대상과 차이점](https://blog.naver.com/PostView.nhn?blogId=youji4ever&logNo=222292901767&parentCategoryNo=&categoryNo=&viewDate=&isShowPopularPosts=false&from=postView)